---
kind: method
id: M:Autodesk.Revit.DB.UV.Normalize
source: html/2bbced1b-ef0a-a497-0245-828eca827bc0.htm
---
# Autodesk.Revit.DB.UV.Normalize Method

Returns a new UV whose coordinates are the normalized values from this vector.

## Syntax (C#)
```csharp
public UV Normalize()
```

## Returns
The normalized UV or zero if the vector is almost Zero.

## Remarks
Normalized indicates that the length of this vector equals one
(a unit vector).